stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/cycles_measure.c
/**
******************************************************************************
* @file    cycles_measure.c
* @author  MCD Application Team
* @brief   Helper file to manage cycles measures
*          parallel audio path
*******************************************************************************
* @attention
*
* Copyright (c) 2019(-2022) STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
********************************************************************************
*/


/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdlib.h>
#include <stdio.h>

#include "cycles_measure.h"
#include "audio_chain_instance.h"
#include "main_hooks.h"
#include "stm32_term_tasks.h"

#ifdef USE_PARTNER_AFE
  #include "user_afe.h"
#endif

#ifndef AUDIO_CHAIN_RELEASE
  #include "st_message.h"
#endif

#ifdef USE_THREADX
  #include "tx_user.h"
  #if (TX_EXECUTION_PROFILE_ENABLE == 1) && defined(TX_CORTEX_M_EPK)
    #define TX_EXECUTION_ISR_PROFILE
  #endif
#endif
#ifdef TX_EXECUTION_ISR_PROFILE
  #include "tx_api.h"
  #include "tx_execution_profile.h"
  #define TX_EXECUTION_ISR_ENTER _tx_execution_isr_enter();
  #define TX_EXECUTION_ISR_EXIT  _tx_execution_isr_exit();
#else
  #define TX_EXECUTION_ISR_ENTER
  #define TX_EXECUTION_ISR_EXIT
#endif


/* Global variables ----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
// structure for background task, terminal task, audio interrupts, audio capture, etc... cycles measure
static CycleStatsTypeDef G_audioInterruptsCycles;
static CycleStatsTypeDef G_audioCaptureCycles;
static CycleStatsTypeDef G_backgroundCycles;
static CycleStatsTypeDef G_terminalCycles;
static CycleStatsTypeDef G_uartIrqCycles;
static CycleStatsTypeDef G_uartDmaStreamTxIrqCycles;
static CycleStatsTypeDef G_uartDmaStreamRxIrqCycles;
#ifndef AUDIO_CHAIN_RELEASE
  static CycleStatsTypeDef G_stMsgCycles;
#endif
#ifdef USE_ETHERNET
  static CycleStatsTypeDef G_netRxCycles;
  static CycleStatsTypeDef G_netTxCycles;
  static CycleStatsTypeDef G_netIfCycles;
  static CycleStatsTypeDef G_netLinkCycles;
#endif

/* Functions Definition ------------------------------------------------------*/
void displayDetailedCycleCount(bool const traceLog, bool const interruptsOnly, cyclesMeasure_values_t *const pCyclesMeasure_values)
{
  if (pCyclesMeasure_values != NULL)
  {
    cycles_stats_t audioInterruptsCyclesStats;
    cycles_stats_t uartIrqCyclesStats, uartDmaStreamTxIrqCyclesStats;
    cycles_stats_t uartDmaStreamRxIrqCyclesStats;
    uint32_t       uartInterruptsHz;

    memset(pCyclesMeasure_values, 0, sizeof(cyclesMeasure_values_t));

    // audio interrupts cycles
    cycleMeasure_getCyclesMgntStats(&G_audioInterruptsCycles, &audioInterruptsCyclesStats, CYCLES_LAST_MEASURE);
    pCyclesMeasure_values->audioInterrupt.pcent = audioInterruptsCyclesStats.averageCpuLoadPcent;
    pCyclesMeasure_values->audioInterrupt.MHz   = 0.000001f * (float)audioInterruptsCyclesStats.averageCpuLoadHz;

    // UART interrupts cycles
    cycleMeasure_getCyclesMgntStats(&G_uartIrqCycles,            &uartIrqCyclesStats,            CYCLES_LAST_MEASURE);
    cycleMeasure_getCyclesMgntStats(&G_uartDmaStreamTxIrqCycles, &uartDmaStreamTxIrqCyclesStats, CYCLES_LAST_MEASURE);
    cycleMeasure_getCyclesMgntStats(&G_uartDmaStreamRxIrqCycles, &uartDmaStreamRxIrqCyclesStats, CYCLES_LAST_MEASURE);
    pCyclesMeasure_values->uartInterrupt.pcent = uartIrqCyclesStats.averageCpuLoadPcent + uartDmaStreamTxIrqCyclesStats.averageCpuLoadPcent + uartDmaStreamRxIrqCyclesStats.averageCpuLoadPcent;
    uartInterruptsHz                           = uartIrqCyclesStats.averageCpuLoadHz    + uartDmaStreamTxIrqCyclesStats.averageCpuLoadHz    + uartDmaStreamRxIrqCyclesStats.averageCpuLoadHz;
    pCyclesMeasure_values->uartInterrupt.MHz   = 0.000001f * (float)uartInterruptsHz;

    if (interruptsOnly)
    {
      if (traceLog)
      {
        UTIL_TERM_printf("AudioInterrupts    : %5.2f%% - %6.2f MHz\n", (double)pCyclesMeasure_values->audioInterrupt.pcent, (double)pCyclesMeasure_values->audioInterrupt.MHz);
        UTIL_TERM_printf("UART interrupts    : %5.2f%% - %6.2f MHz\n", (double)pCyclesMeasure_values->uartInterrupt.pcent, (double)pCyclesMeasure_values->uartInterrupt.MHz);
      }
    }
    else
    {
      bool const     audioChainStarted = AudioChain_isStarted(&AudioChainInstance);
      cycles_stats_t audioCaptureCyclesStats;
      cycles_stats_t terminalCyclesStats;
      #ifndef AUDIO_CHAIN_RELEASE
      cycles_stats_t stMsgCyclesStats;
      #endif
      #ifdef USE_PARTNER_AFE
      cycles_stats_t afePartnerCyclesStats;
      #endif
      #ifdef USE_ETHERNET
      cycles_stats_t netRxCyclesStats, netTxCyclesStats, netIfCyclesStats, netLinkCyclesStats;
      #endif
      cycles_stats_t backgroundCyclesStats;
      cycles_stats_t audioChainDataInOutCyclesStats, audioChainProcessCyclesStats, audioChainProcessLowLevelCyclesStats, audioChainControlCyclesStats;
      float          audioChainTotalPcent, audioTotalPcent, totalPcent;
      float          audioChainTotalMHz,   audioTotalMHz,   totalMHz;

      // audio capture cycles
      cycleMeasure_getCyclesMgntStats(&G_audioCaptureCycles, &audioCaptureCyclesStats, CYCLES_LAST_MEASURE);
      pCyclesMeasure_values->audioCaptureTask.pcent = audioCaptureCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->audioCaptureTask.MHz   = 0.000001f * (float)audioCaptureCyclesStats.averageCpuLoadHz;

