stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/cycles_measure.c
      // audio cycles
      audioTotalPcent = pCyclesMeasure_values->audioInterrupt.pcent + pCyclesMeasure_values->audioCaptureTask.pcent;
      audioTotalMHz   = pCyclesMeasure_values->audioInterrupt.MHz   + pCyclesMeasure_values->audioCaptureTask.MHz;

      if (audioChainStarted)
      {
        float algosTotalPcent;
        float algosTotalMHz;
        float audioDataInOutPcent;
        float audioProcessPcent;
        float audioProcessLowLevelPcent;
        float audioControlPcent;
        float audioDataInOutMHz;
        float audioProcessMHz;
        float audioProcessLowLevelMHz;
        float audioControlMHz;

        // algos cycles
        if (traceLog)
        {
          UTIL_TERM_printf("audio-chain algos:\n");
        }
        for (audio_algo_list_t *pAlgoList = AudioChain_getAlgosList(&AudioChainInstance); pAlgoList != NULL; pAlgoList = pAlgoList->next)
        {
          CycleStatsTypeDef *const pAlgoDataInOutCycleStats = AudioAlgo_getDataInOutCyclesMgntStats(pAlgoList->pAlgo);
          CycleStatsTypeDef *const pAlgoProcessCycleStats   = AudioAlgo_getProcessCyclesMgntStats(pAlgoList->pAlgo);
          CycleStatsTypeDef *const pAlgoControlCycleStats   = AudioAlgo_getControlCyclesMgntStats(pAlgoList->pAlgo);
          cycles_stats_t           algoDataInOutCyclesStats, algoProcessCyclesStats, algoControlCyclesStats;
          float                    algoDataInOutPcent, algoProcessPcent, algoControlPcent, algoTotalPcent;
          float                    algoDataInOutMHz,   algoProcessMHz,   algoControlMHz,   algoTotalMHz;
          bool                     processLowLevel = (pAlgoProcessCycleStats->task == PROCESSLOWLEVEL_TASK);

          cycleMeasure_getCyclesMgntStats(pAlgoDataInOutCycleStats, &algoDataInOutCyclesStats, CYCLES_LAST_MEASURE);
          cycleMeasure_getCyclesMgntStats(pAlgoProcessCycleStats,   &algoProcessCyclesStats,   CYCLES_LAST_MEASURE);
          cycleMeasure_getCyclesMgntStats(pAlgoControlCycleStats,   &algoControlCyclesStats,   CYCLES_LAST_MEASURE);
          algoDataInOutPcent = algoDataInOutCyclesStats.averageCpuLoadPcent;
          algoProcessPcent   = algoProcessCyclesStats.averageCpuLoadPcent;
          algoControlPcent   = algoControlCyclesStats.averageCpuLoadPcent;
          algoDataInOutMHz   = 0.000001f * (float)algoDataInOutCyclesStats.averageCpuLoadHz;
          algoProcessMHz     = 0.000001f * (float)algoProcessCyclesStats.averageCpuLoadHz;
          algoControlMHz     = 0.000001f * (float)algoControlCyclesStats.averageCpuLoadHz;
          algoTotalPcent     = algoDataInOutPcent + algoProcessPcent + algoControlPcent;
          algoTotalMHz       = algoDataInOutMHz   + algoProcessMHz   + algoControlMHz;
          if (traceLog)
          {
            UTIL_TERM_printf("  %s:\n"
                             "    DataInOut      : %5.2f%% - %6.2f MHz\n"
                             "    %s: %5.2f%% - %6.2f MHz\n"
                             "    Control        : %5.2f%% - %6.2f MHz\n"
                             "    Total          : %5.2f%% - %6.2f MHz\n",
                             AudioAlgo_getFullDescriptionString(pAlgoList->pAlgo),
                             (double)algoDataInOutPcent, (double)algoDataInOutMHz,
                             processLowLevel ? "ProcessLowLevel" : "Process        ",
                             (double)algoProcessPcent, (double)algoProcessMHz,
                             (double)algoControlPcent, (double)algoControlMHz,
                             (double)algoTotalPcent, (double)algoTotalMHz);
          }

          pCyclesMeasure_values->algosDataInOutTask.pcent += algoDataInOutPcent;
          pCyclesMeasure_values->algosDataInOutTask.MHz   += algoDataInOutMHz;
          if (processLowLevel)
          {
            pCyclesMeasure_values->algosProcessLowLevelTask.pcent += algoProcessPcent;
            pCyclesMeasure_values->algosProcessLowLevelTask.MHz   += algoProcessMHz;
          }
          else
          {
            pCyclesMeasure_values->algosProcessTask.pcent += algoProcessPcent;
            pCyclesMeasure_values->algosProcessTask.MHz   += algoProcessMHz;
          }
          pCyclesMeasure_values->algosControlTask.pcent += algoControlPcent;
          pCyclesMeasure_values->algosControlTask.MHz   += algoControlMHz;
        }
        algosTotalPcent = pCyclesMeasure_values->algosDataInOutTask.pcent + pCyclesMeasure_values->algosProcessTask.pcent + pCyclesMeasure_values->algosProcessLowLevelTask.pcent + pCyclesMeasure_values->algosControlTask.pcent;
        algosTotalMHz   = pCyclesMeasure_values->algosDataInOutTask.MHz   + pCyclesMeasure_values->algosProcessTask.MHz   + pCyclesMeasure_values->algosProcessLowLevelTask.MHz   + pCyclesMeasure_values->algosControlTask.MHz;
        if (traceLog)
        {
          UTIL_TERM_printf("total audio-chain algos:\n"
                           "    DataInOut      : %5.2f%% - %6.2f MHz\n"
                           "    Process        : %5.2f%% - %6.2f MHz\n"
                           "    ProcessLowLevel: %5.2f%% - %6.2f MHz\n"
                           "    Control        : %5.2f%% - %6.2f MHz\n"
                           "    Total          : %5.2f%% - %6.2f MHz\n",
                           (double)pCyclesMeasure_values->algosDataInOutTask.pcent, (double)pCyclesMeasure_values->algosDataInOutTask.MHz,
                           (double)pCyclesMeasure_values->algosProcessTask.pcent, (double)pCyclesMeasure_values->algosProcessTask.MHz,
                           (double)pCyclesMeasure_values->algosProcessLowLevelTask.pcent, (double)pCyclesMeasure_values->algosProcessLowLevelTask.MHz,
                           (double)pCyclesMeasure_values->algosControlTask.pcent, (double)pCyclesMeasure_values->algosControlTask.MHz,
                           (double)algosTotalPcent, (double)algosTotalMHz);
        }

        // audio chain cycles
        cycleMeasure_getCyclesMgntStats(AudioChain_getDataInOutTaskCycleMgntStats(&AudioChainInstance),       &audioChainDataInOutCyclesStats,       CYCLES_LAST_MEASURE);
        cycleMeasure_getCyclesMgntStats(AudioChain_getProcessTaskCycleMgntStats(&AudioChainInstance),         &audioChainProcessCyclesStats,         CYCLES_LAST_MEASURE);
        cycleMeasure_getCyclesMgntStats(AudioChain_getProcessLowLevelTaskCycleMgntStats(&AudioChainInstance), &audioChainProcessLowLevelCyclesStats, CYCLES_LAST_MEASURE);
        cycleMeasure_getCyclesMgntStats(AudioChain_getControlTaskCycleMgntStats(&AudioChainInstance),         &audioChainControlCyclesStats,         CYCLES_LAST_MEASURE);
        pCyclesMeasure_values->frameworkDataInOutTask.pcent       = audioChainDataInOutCyclesStats.averageCpuLoadPcent;
        pCyclesMeasure_values->frameworkProcessTask.pcent         = audioChainProcessCyclesStats.averageCpuLoadPcent;
        pCyclesMeasure_values->frameworkProcessLowLevelTask.pcent = audioChainProcessLowLevelCyclesStats.averageCpuLoadPcent;
        pCyclesMeasure_values->frameworkControlTask.pcent         = audioChainControlCyclesStats.averageCpuLoadPcent;
        pCyclesMeasure_values->frameworkDataInOutTask.MHz         = 0.000001f * (float)audioChainDataInOutCyclesStats.averageCpuLoadHz;
        pCyclesMeasure_values->frameworkProcessTask.MHz           = 0.000001f * (float)audioChainProcessCyclesStats.averageCpuLoadHz;
        pCyclesMeasure_values->frameworkProcessLowLevelTask.MHz   = 0.000001f * (float)audioChainProcessLowLevelCyclesStats.averageCpuLoadHz;
        pCyclesMeasure_values->frameworkControlTask.MHz           = 0.000001f * (float)audioChainControlCyclesStats.averageCpuLoadHz;
        audioChainTotalPcent                                      = pCyclesMeasure_values->frameworkDataInOutTask.pcent + pCyclesMeasure_values->frameworkProcessTask.pcent + pCyclesMeasure_values->frameworkProcessLowLevelTask.pcent + pCyclesMeasure_values->frameworkControlTask.pcent;
        audioChainTotalMHz                                        = pCyclesMeasure_values->frameworkDataInOutTask.MHz   + pCyclesMeasure_values->frameworkProcessTask.MHz   + pCyclesMeasure_values->frameworkProcessLowLevelTask.MHz   + pCyclesMeasure_values->frameworkControlTask.MHz;
        if (traceLog)
        {
          UTIL_TERM_printf("audio-chain tasks (audio framework):\n"
                           "    DataInOut      : %5.2f%% - %6.2f MHz\n"
                           "    Process        : %5.2f%% - %6.2f MHz\n"
                           "    ProcessLowLevel: %5.2f%% - %6.2f MHz\n"
                           "    Control        : %5.2f%% - %6.2f MHz\n"
                           "    Total          : %5.2f%% - %6.2f MHz\n",
                           (double)pCyclesMeasure_values->frameworkDataInOutTask.pcent, (double)pCyclesMeasure_values->frameworkDataInOutTask.MHz,
                           (double)pCyclesMeasure_values->frameworkProcessTask.pcent, (double)pCyclesMeasure_values->frameworkProcessTask.MHz,
                           (double)pCyclesMeasure_values->frameworkProcessLowLevelTask.pcent, (double)pCyclesMeasure_values->frameworkProcessLowLevelTask.MHz,
                           (double)pCyclesMeasure_values->frameworkControlTask.pcent, (double)pCyclesMeasure_values->frameworkControlTask.MHz,
                           (double)audioChainTotalPcent, (double)audioChainTotalMHz);
        }
        audioDataInOutPcent       = pCyclesMeasure_values->algosDataInOutTask.pcent       + pCyclesMeasure_values->frameworkDataInOutTask.pcent;
        audioProcessPcent         = pCyclesMeasure_values->algosProcessTask.pcent         + pCyclesMeasure_values->frameworkProcessTask.pcent;
        audioProcessLowLevelPcent = pCyclesMeasure_values->algosProcessLowLevelTask.pcent + pCyclesMeasure_values->frameworkProcessLowLevelTask.pcent;
        audioControlPcent         = pCyclesMeasure_values->algosControlTask.pcent         + pCyclesMeasure_values->frameworkControlTask.pcent;
        audioDataInOutMHz         = pCyclesMeasure_values->algosDataInOutTask.MHz         + pCyclesMeasure_values->frameworkDataInOutTask.MHz;
        audioProcessMHz           = pCyclesMeasure_values->algosProcessTask.MHz           + pCyclesMeasure_values->frameworkProcessTask.MHz;
        audioProcessLowLevelMHz   = pCyclesMeasure_values->algosProcessLowLevelTask.MHz   + pCyclesMeasure_values->frameworkProcessLowLevelTask.MHz;
        audioControlMHz           = pCyclesMeasure_values->algosControlTask.MHz           + pCyclesMeasure_values->frameworkControlTask.MHz;

        // PARTNER AFE messages task cycles
        #ifdef USE_PARTNER_AFE
        if (userAfe_getCyclesStat() != NULL)
        {
          cycleMeasure_getCyclesMgntStats(userAfe_getCyclesStat(), &afePartnerCyclesStats, CYCLES_LAST_MEASURE);
          pCyclesMeasure_values->afePartnerTask.pcent = afePartnerCyclesStats.averageCpuLoadPcent;
          pCyclesMeasure_values->afePartnerTask.MHz   = 0.000001f * (float)afePartnerCyclesStats.averageCpuLoadHz;
        }
        #endif

        audioTotalPcent += audioDataInOutPcent + audioProcessPcent + audioProcessLowLevelPcent + audioControlPcent + pCyclesMeasure_values->afePartnerTask.pcent;
        audioTotalMHz   += audioDataInOutMHz   + audioProcessMHz   + audioProcessLowLevelMHz   + audioControlMHz   + pCyclesMeasure_values->afePartnerTask.MHz;
        if (traceLog)
        {
          UTIL_TERM_printf("total audio:\n"
                           "    AudioInterrupts: %5.2f%% - %6.2f MHz\n"
                           "    AudioCapture   : %5.2f%% - %6.2f MHz\n"
                           "    DataInOut      : %5.2f%% - %6.2f MHz\n"
                           "    Process        : %5.2f%% - %6.2f MHz\n"
                           "    ProcessLowLevel: %5.2f%% - %6.2f MHz\n"
                           "    Control        : %5.2f%% - %6.2f MHz\n"
                           #ifdef USE_PARTNER_AFE
                           "    AFE            : %5.2f%% - %6.2f MHz\n"
                           #endif
                           "    Total          : %5.2f%% - %6.2f MHz\n\n",
                           (double)pCyclesMeasure_values->audioInterrupt.pcent, (double)pCyclesMeasure_values->audioInterrupt.MHz,
                           (double)pCyclesMeasure_values->audioCaptureTask.pcent, (double)pCyclesMeasure_values->audioCaptureTask.MHz,
                           (double)audioDataInOutPcent, (double)audioDataInOutMHz,
                           (double)audioProcessPcent, (double)audioProcessMHz,
                           (double)audioProcessLowLevelPcent, (double)audioProcessLowLevelMHz,
                           (double)audioControlPcent, (double)audioControlMHz,
                           #ifdef USE_PARTNER_AFE
                           (double)pCyclesMeasure_values->afePartnerTask.pcent, (double)pCyclesMeasure_values->afePartnerTask.MHz,
                           #endif
                           (double)audioTotalPcent, (double)audioTotalMHz);
        }
      }
      else
      {
        if (traceLog)
        {
          UTIL_TERM_printf("total audio:\n"
                           "    AudioInterrupts: %5.2f%% - %6.2f MHz\n"
                           "    AudioCapture   : %5.2f%% - %6.2f MHz\n"
                           "    Total          : %5.2f%% - %6.2f MHz\n\n",
                           (double)pCyclesMeasure_values->audioInterrupt.pcent, (double)pCyclesMeasure_values->audioInterrupt.MHz,
                           (double)pCyclesMeasure_values->audioCaptureTask.pcent, (double)pCyclesMeasure_values->audioCaptureTask.MHz,
                           (double)audioTotalPcent, (double)audioTotalMHz);
        }
      }

      // Ethernet messages task cycles
      #ifdef USE_ETHERNET
      cycleMeasure_getCyclesMgntStats(&G_netRxCycles,   &netRxCyclesStats,   CYCLES_LAST_MEASURE);
      cycleMeasure_getCyclesMgntStats(&G_netTxCycles,   &netTxCyclesStats,   CYCLES_LAST_MEASURE);
      cycleMeasure_getCyclesMgntStats(&G_netIfCycles,   &netIfCyclesStats,   CYCLES_LAST_MEASURE);
      cycleMeasure_getCyclesMgntStats(&G_netLinkCycles, &netLinkCyclesStats, CYCLES_LAST_MEASURE);
      pCyclesMeasure_values->netRx.pcent   = netRxCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->netRx.MHz     = 0.000001f * (float)netRxCyclesStats.averageCpuLoadHz;
      pCyclesMeasure_values->netTx.pcent   = netTxCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->netTx.MHz     = 0.000001f * (float)netTxCyclesStats.averageCpuLoadHz;
      pCyclesMeasure_values->netIf.pcent   = netIfCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->netIf.MHz     = 0.000001f * (float)netIfCyclesStats.averageCpuLoadHz;
      pCyclesMeasure_values->netLink.pcent = netLinkCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->netLink.MHz   = 0.000001f * (float)netLinkCyclesStats.averageCpuLoadHz;
      if (traceLog)
      {
        UTIL_TERM_printf("Ethernet tasks (TCP/IP not measured):\n"
                         "  network RX       : %5.2f%% - %6.2f MHz\n"
                         "  network TX       : %5.2f%% - %6.2f MHz\n"
                         "  network IF       : %5.2f%% - %6.2f MHz\n"
                         "  network Link     : %5.2f%% - %6.2f MHz\n\n",
                         (double)pCyclesMeasure_values->netRx.pcent, (double)pCyclesMeasure_values->netRx.MHz,
                         (double)pCyclesMeasure_values->netTx.pcent, (double)pCyclesMeasure_values->netTx.MHz,
                         (double)pCyclesMeasure_values->netIf.pcent, (double)pCyclesMeasure_values->netIf.MHz,
                         (double)pCyclesMeasure_values->netLink.pcent, (double)pCyclesMeasure_values->netLink.MHz);
      }
      #endif

      // terminal task cycles
      cycleMeasure_getCyclesMgntStats(&G_terminalCycles, &terminalCyclesStats, CYCLES_LAST_MEASURE);
      pCyclesMeasure_values->terminalTask.pcent = terminalCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->terminalTask.MHz   = 0.000001f * (float)terminalCyclesStats.averageCpuLoadHz;
      if (traceLog)
      {
        UTIL_TERM_printf("UART interrupts    : %5.2f%% - %6.2f MHz\n", (double)pCyclesMeasure_values->uartInterrupt.pcent, (double)pCyclesMeasure_values->uartInterrupt.MHz);
        UTIL_TERM_printf("Terminal task      : %5.2f%% - %6.2f MHz\n", (double)pCyclesMeasure_values->terminalTask.pcent, (double)pCyclesMeasure_values->terminalTask.MHz);
      }

      #ifndef AUDIO_CHAIN_RELEASE
      // ST messages task cycles
      cycleMeasure_getCyclesMgntStats(&G_stMsgCycles, &stMsgCyclesStats, CYCLES_LAST_MEASURE);
      pCyclesMeasure_values->stMessageTask.pcent = stMsgCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->stMessageTask.MHz   = 0.000001f * (float)stMsgCyclesStats.averageCpuLoadHz;
      if (traceLog)
      {
        UTIL_TERM_printf("ST messages task   : %5.2f%% - %6.2f MHz\n", (double)pCyclesMeasure_values->stMessageTask.pcent, (double)pCyclesMeasure_values->stMessageTask.MHz);
      }
      #endif

      // background task cycles
      cycleMeasure_getCyclesMgntStats(&G_backgroundCycles, &backgroundCyclesStats, CYCLES_LAST_MEASURE);
      pCyclesMeasure_values->backGroundTask.pcent = backgroundCyclesStats.averageCpuLoadPcent;
      pCyclesMeasure_values->backGroundTask.MHz   = 0.000001f * (float)backgroundCyclesStats.averageCpuLoadHz;
      if (traceLog)
      {
        UTIL_TERM_printf("Background task    : %5.2f%% - %6.2f MHz\n\n", (double)pCyclesMeasure_values->backGroundTask.pcent, (double)pCyclesMeasure_values->backGroundTask.MHz);
      }

      // grand total cycles
      totalPcent = audioTotalPcent + pCyclesMeasure_values->terminalTask.pcent + pCyclesMeasure_values->netRx.pcent + pCyclesMeasure_values->netTx.pcent + pCyclesMeasure_values->netIf.pcent + pCyclesMeasure_values->netLink.pcent + pCyclesMeasure_values->stMessageTask.pcent + pCyclesMeasure_values->uartInterrupt.pcent + pCyclesMeasure_values->backGroundTask.pcent;
      totalMHz   = audioTotalMHz   + pCyclesMeasure_values->terminalTask.MHz   + pCyclesMeasure_values->netRx.MHz   + pCyclesMeasure_values->netTx.MHz   + pCyclesMeasure_values->netIf.MHz   + pCyclesMeasure_values->netLink.MHz   + pCyclesMeasure_values->stMessageTask.MHz   + pCyclesMeasure_values->uartInterrupt.MHz   + pCyclesMeasure_values->backGroundTask.MHz;
      if (traceLog)
      {
        UTIL_TERM_printf("Total              : %5.2f%% - %6.2f MHz\n\n", (double)totalPcent, (double)totalMHz);
      }
    }
  }
}


