stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/cycles_measure.c
// redefinition of __weak routines for cycles measure
#ifdef USE_ETHERNET
void NetRx_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_netRxCycles.pName = "NetRx";
  G_netRxCycles.task  = OTHER_TASK;
}


void NetRx_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_netRxCycles);
}


void NetRx_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_netRxCycles);
}


void NetRx_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_netRxCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_netRxCycles */
    NetRx_cycleMeasure_Reset();
  }
}


void NetTx_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_netTxCycles.pName = "NetTx";
  G_netTxCycles.task  = OTHER_TASK;
}


void NetTx_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_netTxCycles);
}


void NetTx_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_netTxCycles);
}


void NetTx_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_netTxCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_netTxCycles */
    NetTx_cycleMeasure_Reset();
  }
}


void NetIf_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_netIfCycles.pName = "NetIf";
  G_netIfCycles.task  = OTHER_TASK;
}


void NetIf_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_netIfCycles);
}


void NetIf_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_netIfCycles);
}


void NetIf_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_netIfCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_netIfCycles */
    NetIf_cycleMeasure_Reset();
  }
}


void NetLink_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_netLinkCycles.pName = "NetLink";
  G_netLinkCycles.task  = OTHER_TASK;
}


void NetLink_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_netLinkCycles);
}


void NetLink_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_netLinkCycles);
}


void NetLink_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_netLinkCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_netLinkCycles */
    NetLink_cycleMeasure_Reset();
  }
}
#endif // USE_ETHERNET


void UTIL_TERM_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_terminalCycles.pName = "Terminal";
  G_terminalCycles.task  = OTHER_TASK;
}


void UTIL_TERM_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_terminalCycles);
}


void UTIL_TERM_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_terminalCycles);
}


void UTIL_TERM_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_terminalCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_terminalCycles */
    UTIL_TERM_cycleMeasure_Reset();
  }
}


#ifndef AUDIO_CHAIN_RELEASE
void st_message_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_stMsgCycles.pName = "ST messages";
  G_stMsgCycles.task  = OTHER_TASK;
}


void st_message_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_stMsgCycles);
}


void st_message_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_stMsgCycles);
}


void st_message_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_stMsgCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_stMsgCycles */
    st_message_cycleMeasure_Reset();
  }
}
#endif


void main_hooks_cyclesMeasureInit(void)
{
  cycleMeasure_Init();
  G_backgroundCycles.pName = "background";
  G_backgroundCycles.task  = OTHER_TASK;
}


void main_hooks_cyclesMeasureReset(void)
{
  cycleMeasure_Reset(&G_backgroundCycles);
}


void main_hooks_cyclesMeasureStart(void)
{
  cycleMeasure_Start(&G_backgroundCycles);
}


void main_hooks_cyclesMeasureStop(void)
{
  if (cycleMeasure_Stop(&G_backgroundCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_backgroundCycles */
    main_hooks_cyclesMeasureReset();
  }
}


void UTIL_UART_IRQ_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_uartIrqCycles.pName = "UART IRQ";
  G_uartIrqCycles.task  = INTERRUPT;
}


void UTIL_UART_IRQ_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_uartIrqCycles);
}


void UTIL_UART_IRQ_cycleMeasure_Start(void)
{
  TX_EXECUTION_ISR_ENTER
  cycleMeasure_Start(&G_uartIrqCycles);
}


void UTIL_UART_IRQ_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_uartIrqCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_uartIrqCycles */
    UTIL_UART_IRQ_cycleMeasure_Reset();
  }
  TX_EXECUTION_ISR_EXIT
}


void UTIL_UART_DMA_STREAM_RX_IRQ_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_uartDmaStreamRxIrqCycles.pName = "UART DMA RX IRQ";
  G_uartDmaStreamRxIrqCycles.task  = INTERRUPT;
}


void UTIL_UART_DMA_STREAM_RX_IRQ_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_uartDmaStreamRxIrqCycles);
}


void UTIL_UART_DMA_STREAM_RX_IRQ_cycleMeasure_Start(void)
{
  TX_EXECUTION_ISR_ENTER
  cycleMeasure_Start(&G_uartDmaStreamRxIrqCycles);
}


void UTIL_UART_DMA_STREAM_RX_IRQ_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_uartDmaStreamRxIrqCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_uartDmaStreamRxIrqCycles */
    UTIL_UART_DMA_STREAM_RX_IRQ_cycleMeasure_Reset();
  }
  TX_EXECUTION_ISR_EXIT
}


void UTIL_UART_DMA_STREAM_TX_IRQ_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_uartDmaStreamTxIrqCycles.pName = "UART DMA TX IRQ";
  G_uartDmaStreamTxIrqCycles.task  = INTERRUPT;
}


void UTIL_UART_DMA_STREAM_TX_IRQ_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_uartDmaStreamTxIrqCycles);
}


void UTIL_UART_DMA_STREAM_TX_IRQ_cycleMeasure_Start(void)
{
  TX_EXECUTION_ISR_ENTER
  cycleMeasure_Start(&G_uartDmaStreamTxIrqCycles);
}


void UTIL_UART_DMA_STREAM_TX_IRQ_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_uartDmaStreamTxIrqCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_uartDmaStreamTxIrqCycles */
    UTIL_UART_DMA_STREAM_TX_IRQ_cycleMeasure_Reset();
  }
  TX_EXECUTION_ISR_EXIT
}


void UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_audioInterruptsCycles.pName = "Audio IRQ";
  G_audioInterruptsCycles.task  = INTERRUPT;
}


void UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_audioInterruptsCycles);
}


void UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Start(void)
{
  TX_EXECUTION_ISR_ENTER
  cycleMeasure_Start(&G_audioInterruptsCycles);
}


void UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_audioInterruptsCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_audioInterruptsCycles */
    UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Reset();
  }
  TX_EXECUTION_ISR_EXIT
}


void UTIL_AUDIO_cycleMeasure_Init(void)
{
  cycleMeasure_Init();
  G_audioCaptureCycles.pName = "Audio capture";
  G_audioCaptureCycles.task  = OTHER_TASK;
}


void UTIL_AUDIO_cycleMeasure_Reset(void)
{
  cycleMeasure_Reset(&G_audioCaptureCycles);
}


void UTIL_AUDIO_cycleMeasure_Start(void)
{
  cycleMeasure_Start(&G_audioCaptureCycles);
}


void UTIL_AUDIO_cycleMeasure_Stop(void)
{
  if (cycleMeasure_Stop(&G_audioCaptureCycles, AudioChainInstance_getCycleCountMeasureTimeout()))
  {
    /* add here any stuff you want regarding G_audioCaptureCycles */
    UTIL_AUDIO_cycleMeasure_Reset();
  }
}
